# BuiltInFailures.PerformanceFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PerformanceFailures Class
BuiltInFailures Class Members See Also
---
Failures which give hints pointing to situations where performance could be improved.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class PerformanceFailures
```

Visual Basic
---
```text
Public NotInheritable Class PerformanceFailures
```

Visual C++
---
```text
public ref class PerformanceFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..PerformanceFailures
# See Also
BuiltInFailures..::..PerformanceFailures Members
Autodesk.Revit.DB Namespace